Repository: riomus/mesh
Catalog: lib/l10n/app_*.arb
Languages: pl

# appTitle
source: Mesh BLE Scanner
pl: Mesh BLE Skaner

# nearbyDevicesTitle
source: Nearby Bluetooth Devices
pl: Najbliższe urzdzenia Bluetooth

source: Scan
pl: Skanuj

source: Stop
pl: Zatrzymaj

# toggleThemeTooltip
source: Toggle theme
pl: Przecz motyw

# languageTooltip
source: Change language
pl: Zmie jzyk

source: General
pl: Ogólne

source: Identifier
pl: Identyfikator

source: Platform name
pl: Nazwa platformy

source: Signal (RSSI)
pl: Sygna (RSSI)

source: Advertisement
pl: Reklama

source: Advertised name
pl: Nazwa z reklamy

source: Connectable
pl: Możliwo poczenia

source: Connect
pl: Pocz

source: Disconnect
pl: Rozcz

source: Yes
pl: Tak

source: No
pl: Nie

source: Service
pl: Usuga

source: Service UUIDs
pl: UUID usug

# serviceUuidsWithCount
source: Service UUIDs ({count})
pl: UUID usug ({count})

source: Manufacturer Data
pl: Dane producenta

# manufacturerDataWithCount
source: Manufacturer Data ({count})
pl: Dane producenta ({count})

source: Service Data
pl: Dane usug

# serviceDataWithCount
source: Service Data ({count})
pl: Dane usug ({count})

source: None advertised
pl: Brak danych

# bluetoothOn
source: Bluetooth is ON
pl: Bluetooth jest WCZONY

# bluetoothOff
source: Bluetooth is OFF
pl: Bluetooth jest WYCZONY

# bluetoothState
source: Bluetooth state: {state}
pl: Stan Bluetooth: {state}

# webNote
source: On Web, scanning shows a chooser after tapping Scan (HTTPS required).
pl: W wersji Web po klikniciu Skanuj pojawia si okno wyboru urzdzenia (wymagany HTTPS).

# tapScanToDiscover
source: Tap Scan to discover nearby Bluetooth devices
pl: Kliknij Skanuj, aby wykry pobliskie urzdzenia Bluetooth

source: unknown
pl: nieznane

# searchHint
source: Search devices by name or ID
pl: Szukaj urzdze po nazwie lub ID

# loraOnlyFilterLabel
source: LoRa only
pl: Tylko LoRa

# settingsButtonLabel
source: Settings
pl: Ustawienia

# nodesTitle
source: Nodes
pl: Wzy

# tabList
source: List
pl: Lista

# tabMap
source: Map
pl: Mapa

source: Logs
pl: Logi

source: Live events
pl: Zdarzenia na żywo

source: Service available
pl: Usuga dostpna

# statusConnected
source: Connected
pl: Poczono

# statusConnecting
source: Connecting...
pl: czenie...

# statusDisconnected
source: Disconnected
pl: Rozczono

source: Clear ref
pl: Wyczy ref

source: Fit bounds
pl: Dopasuj widok

source: Center
pl: Wyrodkuj

source: Use as ref
pl: Użyj jako ref

source: Details
pl: Szczegóy

source: Copy coords
pl: Kopiuj wspórz.

# coordsCopied
source: Coordinates copied
pl: Skopiowano wspórzdne

# noNodesWithLocation
source: No nodes with location yet. Long‑press on the map to set a custom distance reference.
pl: Brak wzów z lokalizacj. Przytrzymaj na mapie aby ustawi wasny punkt odniesienia.

# customRefSet
source: Custom distance reference set to {lat}, {lon}
pl: Ustawiono punkt odniesienia: {lat}, {lon}

source: Search nodes
pl: Szukaj wzów

source: Find by name or id ...
pl: Szukaj po nazwie lub ID ...

source: Clear
pl: Wyczy

source: Add filter
pl: Dodaj filtr

source: Sorting
pl: Sortowanie

source: Clear filters
pl: Wyczy filtry

source: Favorites first
pl: Ulubione na pocztku

source: Distance
pl: Dystans

source: Last seen
pl: Ostatnio widziany

source: Role
pl: Rola

source: Name
pl: Nazwa

source: hops
pl: skoki

source: via
pl: przez

# addFilterTitle
source: Add filter
pl: Dodaj filtr

source: Key
pl: Klucz

source: Exact
pl: Dokadnie

# hasValueFor
source: has {key}
pl: ma {key}

source: Custom value (optional)
pl: Wasna warto (opcjonalnie)

source: Regex (case-insensitive)
pl: Regex (bez rozróżniania wielkoci liter)

source: Reset to default
pl: Przywró domylne

# useSourceAsRef
source: Use source device as distance ref
pl: Użyj urzdzenia źródowego jako ref

# tipSetCustomRef
source: Tip: set a custom reference by long‑pressing on the Map tab
pl: Wskazówka: ustaw ref przytrzymujc na zakadce Mapa

source: Cancel
pl: Anuluj

# addAction
source: Add
pl: Dodaj

source: Battery
pl: Bateria

source: charging
pl: adowanie

source: Location
pl: Lokalizacja

# locationUnavailable
source: Location is not available for this node
pl: Brak lokalizacji dla tego wza

source: Source device
pl: Urzdzenie źródowe

source: via MQTT
pl: przez MQTT

source: Connect failed
pl: Poczenie nieudane

source: Meshtastic connect failed
pl: Poczenie z Meshtastic nieudane

source: Device error
pl: Bd urzdzenia

# eventsTitle
source: Events
pl: Zdarzenia

# failedToShareEvents
source: Failed to share events: {error}
pl: Nie udao si udostpni zdarze: {error}

source: No events yet
pl: Brak zdarze

# eventDetailsTitle
source: Event details
pl: Szczegóy zdarzenia

source: Timestamp
pl: Znacznik czasu

source: Summary
pl: Podsumowanie

source: Tags
pl: Tagi

source: Payload
pl: adunek

source: Waypoint
pl: Punkt trasy

source: User
pl: Użytkownik

source: Routing payload
pl: adunek routingu

source: Admin
pl: Administrator

source: Remote hardware
pl: Zdalny sprzt

source: Neighbor info
pl: Informacje o ssiadach

source: Neighbors
pl: Ssiedzi

source: Store & Forward
pl: Przechowaj i przekaż

source: Telemetry
pl: Telemetria

source: Key verification
pl: Weryfikacja klucza

source: Raw payload
pl: Surowy adunek

source: Fullscreen
pl: Peny ekran

source: Close
pl: Zamknij

# shareEvents
source: Share events (JSON)
pl: Udostpnij zdarzenia (JSON)

# shareLogs
source: Share logs (JSON)
pl: Udostpnij logi (JSON)

source: Logs export
pl: Eksport logów

source: Add filters
pl: Dodaj filtry

source: Resume
pl: Wznów

source: Pause
pl: Pauza

# clearAll
source: Clear
pl: Wyczy

# mapAttribution
source: © OpenStreetMap contributors
pl: © Wspótwórcy OpenStreetMap

# roleLabel
source: Role
pl: Rola

source: Hops away
pl: Skoki

# lastSeenLabel
source: Last seen
pl: Ostatnio widziany

source: Chat
pl: Czat

# typeMessage
source: Type a message...
pl: Wpisz wiadomo...

source: Message too long
pl: Wiadomo za duga

# sendFailed
source: Failed to send: {error}
pl: Nie udao si wysa: {error}

# failedToShareLogs
source: Failed to share logs: {error}
pl: Nie udao si udostpni logów: {error}

# buildPrefix
source: Build:
pl: Wersja:

# builtPrefix
source: Built:
pl: Zbudowano:

# agoSeconds
source: {seconds}s ago
pl: {seconds}s temu

# agoMinutes
source: {minutes}m ago
pl: {minutes}m temu

# agoHours
source: {hours}h ago
pl: {hours}g temu

# agoDays
source: {days}d ago
pl: {days}d temu

# sortAsc
source: ASC
pl: ROS

# sortDesc
source: DESC
pl: MAL

# unknownState
source: Unknown
pl: Nieznany

# languageSystem
source: System
pl: Systemowy

# languageEnglish
source: English
pl: Angielski

# languageFollowSystem
source: Follow system language
pl: Zgodnie z systemem

# nodeTitleHex
source: Node 0x{hex}
pl: Wze 0x{hex}

source: Events export
pl: Eksport zdarze

# languageAppLanguage
source: App language: {language}
pl: Jzyk aplikacji: {language}

source: Event details
pl: Szczegóy zdarzenia

source: Config
pl: Konfiguracja

source: Config complete
pl: Konfiguracja zakoczona

source: Rebooted
pl: Zrestartowano

source: Module config
pl: Konfiguracja moduu

source: Channel
pl: Kana

source: Channels
pl: Kanay

source: Queue status
pl: Stan kolejki

source: Device metadata
pl: Metadane urzdzenia

source: MQTT proxy
pl: Proxy MQTT

source: File info
pl: Informacje o pliku

source: Client notification
pl: Powiadomienie klienta

source: Device UI config
pl: Konfiguracja UI urzdzenia

source: Log record
pl: Wpis logu

source: Packet
pl: Pakiet

source: Text payload
pl: adunek tekstowy

source: Position
pl: Pozycja

# rawPayloadDetails
source: Raw payload ({name}:{id}, {bytes} bytes)
pl: Surowy adunek ({name}:{id}, {bytes} bajtów)

source: Encrypted/unknown payload
pl: Zaszyfrowany/nieznany adunek

source: Config update
pl: Aktualizacja konfiguracji

source: Config stream complete
pl: Strumie konfiguracji zakoczony

source: Device reported reboot
pl: Urzdzenie zgosio restart

source: No reboot
pl: Brak restartu

source: Channel update
pl: Aktualizacja kanau

source: Routing message
pl: Wiadomo routingu

source: Admin message
pl: Wiadomo admina

source: Position update
pl: Aktualizacja pozycji

source: User info
pl: Informacje o użytkowniku

# remoteHw
source: Remote HW: {type} mask={mask} value={value}
pl: Zdalny sprzt: {type} maska={mask} warto={value}

source: Store & Forward ({variant})
pl: Przechowaj i przekaż ({variant})

source: Telemetry ({variant})
pl: Telemetria ({variant})

source: Device
pl: Urzdzenie

source: Serial
pl: Port szeregowy

source: Range test
pl: Test zasigu

source: External notification
pl: Powiadomienie zewntrzne

source: Canned message
pl: Wiadomo szablonowa

source: Ambient lighting
pl: Owietlenie otoczenia

source: Detection sensor
pl: Czujnik wykrywania

source: DTN overlay
pl: Nakadka DTN

source: Broadcast assist
pl: Asystent rozgaszania

source: Node filter
pl: Filtr wzów

source: Node highlight
pl: Podwietlenie wzów

source: Map
pl: Mapa

# nodeTitle
source: Node {name}
pl: Wze {name}

# nodeTitleId
source: Node ({id})
pl: Wze ({id})

# viaNameId
source: via {name} (0x{id})
pl: przez {name} (0x{id})

source: via {name}
pl: przez {name}

# viaId
source: via 0x{id}
pl: przez 0x{id}

# devicesTab
source: Devices
pl: Urzdzenia

source: Search logs
pl: Szukaj w logach

# searchLogsHint
source: Search in time, level, tags or message
pl: Szukaj w czasie, poziomie, tagach lub wiadomoci

# logsTitle
source: Logs
pl: Logi

source: Level
pl: Poziom

# valueEmptyPresence
source: Value (empty = presence only for exact)
pl: Warto (pusta = tylko obecno dla dokadnego)

# regexTip
source: Tip: regex uses Dart syntax and is case-insensitive by default
pl: Wskazówka: regex używa skadni Dart i domylnie nie rozróżnia wielkoci liter

source: Select levels
pl: Wybierz poziomy

source: (unspecified)
pl: (nieokrelony)

source: Connect failed: {error}
pl: Poczenie nieudane: {error}

source: Apply
pl: Zastosuj

source: Coordinates
pl: Wspórzdne

source: Search events
pl: Szukaj zdarze

source: Search in summary or tags
pl: Szukaj w podsumowaniu lub tagach

source: Power
pl: Zasilanie

source: Network
pl: Sie

source: Display
pl: Wywietlacz

source: Security
pl: Bezpieczestwo

source: Session key
pl: Klucz sesji

source: Node mod
pl: Modyfikacje wza

source: Node mod admin
pl: Admin modyfikacji wza

source: Idle game
pl: Gra bezczynnoci

source: Device State
pl: Stan urzdzenia

source: No device state
pl: Brak stanu urzdzenia

# connectToViewState
source: Connect to the device to view its state
pl: Pocz si z urzdzeniem, aby zobaczy jego stan
